app/controllers/coffees_controller.rb

SELECT "coffees".* FROM "coffees"
---
  def index
    @coffees = Coffee.all

INSERT INTO "coffees" ("name", "flavor", "price", "created_at", "updated_at") VALUES ('CT2', 'Brewketch', 30.0, '2026-01-31 08:54:20.266749', '2026-01-31 08:54:20.266749') RETURNING "id"
---
  def create
    @coffee = Coffee.new(coffee_params)
    if @coffee.save

UPDATE "coffees" SET "flavor" = 'Capaccino2', "updated_at" = '2026-01-31 08:43:27.229648' WHERE "coffees"."id" = 1
---
  def update
    if @coffee.update(coffee_params)

SELECT "coffees".* FROM "coffees"
---
  def export
    @coffees = Coffee.all

    csv_data = CSV.generate(headers: true) do |csv|
      csv << ["Name", "Flavor", "Price"]
      @coffees.each do |coffee|

SELECT "coffees".* FROM "coffees" WHERE "coffees"."id" = 1 LIMIT 1
---
  def set_coffee
    @coffee = Coffee.find(params[:id])